## nsmallest
- 说明：  
    - 返回DataFrame或Series中指定列或行的前n个最小值。
    - 根据`n`参数，指定要返回的最小值的数量。
    
- 参数： 
    - `n`: int  
    返回的最小值数量
        - 默认值为5
    - `columns`: scalar | list  
    要排序的列标签
    - `keep`: str  
    保留哪一行
        - 'first'：保留第一次出现的行 (默认)
        - 'last'：保留最后一次出现的行
        - False：删除所有重复行

|类型\参数|`n`|`columns`|`keep`|
|:-------:|:-------:|:-------:|:-------:|
|`DataFrame`|√|√|√|
|`Series`|√||√|

In [1]:
import pandas as pd

df = pd.DataFrame(
    {
        'population': [59000000, 65000000, 434000, 434000, 434000, 337000, 11300, 11300, 11300],
        'GDP': [1937894, 2583560, 12011, 4520, 12128, 17036, 182, 38, 311],
        'alpha-2': ["IT", "FR", "MT", "MV", "BN", "IS", "NR", "TV", "AI"],
    },
    index=["Italy", "France", "Malta", "Maldives", "Brunei", "Iceland", "Nauru", "Tuvalu", "Anguilla"]
)
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [2]:
df.nsmallest(3, 'population')

          population  GDP alpha-2
Nauru          11300  182      NR
Tuvalu         11300   38      TV
Anguilla       11300  311      AI

In [6]:
df.nsmallest(5, ['population', 'GDP'])

          population    GDP alpha-2
Tuvalu         11300     38      TV
Nauru          11300    182      NR
Anguilla       11300    311      AI
Iceland       337000  17036      IS
Maldives      434000   4520      MV

In [7]:
df.GDP.nsmallest()

Tuvalu         38
Nauru         182
Anguilla      311
Maldives     4520
Malta       12011
Name: GDP, dtype: int64